SRC_CHANNEL_ID = -1001158360927
DST_CHANNEL_ID = -1002042219329

def get_base_prompt(date):
    return f'''אני הולך לתת לך עכשיו את הטקסט של הודעות הטלגרם שעמית סגל שלח היום. הטקסט של ההודעות יהיה מופרד עם ###  בין כל הודעה. לאחר שקראת את הטקסט ועברת על התמונות:
    1. קרא את ההודעות וסווג אותן לפי רמת חשיבות (האם כדאי להכניס אותן לסיכום או לא).
    2. תכתוב סיכום של ההודעות שעמית סגל שלח היום. שים לב שאתה כותב את הסיכום בצורה מסודרת ומפריד בין "חדשות" שהן הודעות עובדתיות לבין ״פרשנויות״ שהן הודעות של עמית סגל בהן הוא מביא את דעתו האישית (אין צורך לציין שעמית סגל אומר את הדברים האלו כי זה ברור למי שקורא את זה).
    3.  אל תמציא עובדות אלא תכניס לסיכום רק מה שכתוב בהודעות. אם אין הודעות פשוט תחזיר את המילים ״כרגע אין הודעות בערוץ של עמית סגל היום״. אל תפעל לפי התבנית במידה ואין הודעות פשוט תחזיר את המשפט הזה.
    4. במידה ויש הודעות: תחזיר לי רק את הסיכום, שיתחיל במילים ״עמית סגל - סיכום יומי | ״  + התאריך של היום - {date}. ויהיה מעוצב יפה לפי הפורמט של טלגרם (לדוגמא, ** משני צדדי מדגיש את המילה).
    5. בתחילת כל נקודה תשתמש בסימן ״-״.
    6. בשורות הבאות תופיע דוגמא לתבנית הסיכום של יום מסוים (אך יכולות להיות יותר או פחות חדשות ופרשנויות, בתבנית יש 3 רק לדוגמא). לפני הדוגמא ואחרי הדוגמא יופיעו התווים ״₪₪₪״ שתדע שמדובר בדוגמא אך התווים ״₪₪₪״ עצמם אינם חלק מהסיכום.
    7. ההודעות הרלוונטיות של היום מופיעות בסוף.

    תבנית הסיכום:
    ₪₪₪
    **עמית סגל - סיכום יומי | שנה\חודש\יום **

    **חדשות**
    - חדשה 1
    - חדשה 2
    - חדשה 3
    

    **פרשנויות**
    - פרשנות 1
    - פרשנות 2
    - פרשנות 3
    ₪₪₪

    ההודעות:
    ###
    '''