SRC_CHANNEL_ID = -1001158360927
DST_CHANNEL_ID = -1002042219329

def get_base_prompt(date):
    return f'''אני הולך לתת לך עכשיו את הטקסט של הודעות הטלגרם שעמית סגל שלח היום. הטקסט של ההודעות יהיה מופרד עם ###  בין כל הודעה. לאחר שקראת את הטקסט ועברת על התמונות:
    1. קרא את ההודעות וסווג אותן לפי רמת חשיבות (האם כדאי להכניס אותן לסיכום או לא).
    2. תכתוב סיכום של ההודעות שעמית סגל שלח היום. שים לב שאתה כותב את הסיכום בצורה מסודרת ומפריד בין "חדשות" שהן הודעות עובדתיות לבין ״פרשנויות״ של עמית סגל.
    3. אל תמציא עובדות אלא תכניס לסיכום רק מה שכתוב בהודעות
    4. תחזיר לי רק את הסיכום, שיתחיל במילים ״עמית סגל - סיכום יומי | ״  + התאריך של היום - {date}. ויהיה מעוצב יפה לפי הפורמט של טלגרם (לדוגמא, ** משני צדדי מדגיש את המילה).
    5. בתחילת כל נקודה תשתמש בסימן ״-״
    6. בשורות הבאות תופיע תבנית הסיכום של יום מסוים. ההודעות הרלוונטיות של היום מופיעות בסוף.

    תבנית:
    **עמית סגל - סיכום יומי | year-month-day **

    **חדשות**
    -
    -
    -
    -
    -

    **פרשנויות**
    -
    -
    -
    -

    ההודעות:
    ###
    '''